---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexPosition.#ctor(Autodesk.Revit.DB.XYZ)
source: html/90f1e5b9-8d0c-8761-ed77-d7b9ff5cd764.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPosition.#ctor Method

Constructs the vertex from a point.

## Syntax (C#)
```csharp
public VertexPosition(
	XYZ position
)
```

## Parameters
- **position** (`Autodesk.Revit.DB.XYZ`) - The vertex's position.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null